{"data":{"allStrapiJobs":{"nodes":[{"company":"LendInvest","date":"April 2019 - Present","position":"Web and Product Analyst","desc":[{"id":1,"name":"Process, audit, and analyse SEO impact leading to two-page redesigns based on SEO research and keyword recommendations. "},{"id":3,"name":" Inform dimension modelling for useful and relevant data warehousing of web sessions."},{"id":4,"name":"Create workshops with business leaders to identify strategic metrics to measure and deliver value specific to LI."},{"id":8,"name":"Enhanced reporting using Plotly and Flask deployed on Docker"}]},{"company":"Octopus Labs","date":"September 2018 - May 2019","position":"Web Analyst","desc":[{"id":6,"name":"Created and implemented custom tracking of 20 conversion events, five new custom dimensions including session id tracking and full website audit."},{"id":7,"name":"Created business-tailored and stakeholder-tailored reporting, implementing digital analytics framework "},{"id":9,"name":"Teaching Google Analytics  and Google Data Studio to multiple teams."},{"id":10,"name":"Implemented A/B testing at Octopus"}]},{"company":"Mail Online","date":"May 2017 - August 2019","position":"Web Analyst","desc":[{"id":11,"name":"Performed data mining of competitor videos and posts using Facebook graph API"},{"id":13,"name":"Automated reports using VBA saving approximately one hour per day"},{"id":12,"name":"Conducted deep dives and detailed traffic segmentation for marketing management"}]},{"company":"KCW Today","date":"July 2016 - February 2017","position":"Digital Content & Science Correspondent","desc":[{"id":14,"name":"Optimised and maintained kcwtoday.co.uk, monitoring audience and explaining traffic behaviour."},{"id":15,"name":"Validated testing for website growth, implementing DoubleClick for Publishers tags, site content"},{"id":16,"name":"Planned website upgrade (CMS, hosting, responsive), negotiating proposals within budget"}]},{"company":"CERN","date":"September 2014 - October 2015","position":"Technical Studentship","desc":[{"id":17,"name":"Managed deployment and data analysis of radiation sensors systems (RadMON) at CHARM"},{"id":18,"name":"Co-authored IEEE paper published August 2016, used in EuroMaster’s dissertation (70 %)"},{"id":19,"name":"Created effective lab manual and lab commissioning experiment guide"},{"id":20,"name":"Led measurement campaign involving careful time planning to maximise quality measurements while minimising radioactive damage on instruments as well as personnel for equipment change"}]}]}}}